# IFCParameter Template Export Revit Element Parameters Property

Source: https://www.revitapidocs.com/2026/f67d03a7-b686-87a5-a32d-7951c83cbde1.htm

---

| IFCParameter Template Export Revit Element Parameters Property |
| --- |

The option to export Revit element parameters to IFC.
 If true, then all Revit element parameters not excluded will be exported.
 If false, then no Revit element parameters will be exported.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public bool ExportRevitElementParameters { get; set; }
```

```
Public Property ExportRevitElementParameters As Boolean
	Get
	Set
```

```
public:
property bool ExportRevitElementParameters {
	bool get ();
	void set (bool value);
}
```

```
member ExportRevitElementParameters : bool with get, set
```

#### Property Value

Boolean See Also

#### Reference

IFCParameterTemplate Class Autodesk.Revit.DB Namespace